{
  "Navigation": {
    "home": "Inicio",
    "about": "Sobre Mí",
    "blog": "Blog",
    "contact": "Contacto"
  },
  "Footer": {
    "license": "Desarrollado por Emanuel Escudero",
    "logo": "/Logo2024.png",
    "logoAlt": "Logotipo del Desarrollador",
    "url": "https://emanuelescudero.ar"
  },
  "IndexPage": {
    "title": "🧉 ¡Hola Mundo!",
    "description": "Bienvenido a un ejemplo de aplicación con Internacionalización (i18n) para Next.js.",
    "text1": "La internacionalización (i18n) es una práctica esencial en el desarrollo web moderno que permite a las aplicaciones soportar múltiples idiomas y regiones. En el contexto de Next.js, next-intl facilita este proceso al proporcionar herramientas y funciones para manejar traducciones y formatos locales. Este paquete permite definir y cargar mensajes específicos para cada idioma en archivos JSON, los cuales se pueden organizar en carpetas por idioma. Durante el proceso de renderizado, next-intl selecciona automáticamente los mensajes apropiados basados en el idioma preferido del usuario o el especificado en la URL, asegurando que el contenido se muestre correctamente en el idioma correspondiente.",
    "text2": "Además, next-intl ofrece componentes y hooks fáciles de usar, como NextIntlProvider y useTranslations, que simplifican la integración de traducciones en los componentes de React. Con estos, los desarrolladores pueden acceder a los mensajes traducidos de manera eficiente y utilizarlos en sus interfaces de usuario. La capacidad de manejar múltiples idiomas y configurar rutas específicas para cada localización hace que next-intl sea una herramienta poderosa para crear aplicaciones globales que ofrecen una experiencia de usuario localizada y personalizada. Esto no solo mejora la accesibilidad y la inclusividad, sino que también abre nuevas oportunidades para llegar a audiencias más amplias en diferentes regiones del mundo."
  },
  "AboutPage": {
    "title": "Emanuel Escudero 🤓",
    "description": "Soy Desarrollador FullStack y Técnico Superior en Turismo 🤷‍♂️",
    "text1": "Hoy decidí crear esta app, para practicar la implementación de la herramientas de 'internacionalización' para NextJs. Puedes ver el código fuente en mi repositorio de GitHub 👉 ",
    "text2": "Puedes ver mi sitio web, siguiendo el enlace al final de la página 👇",
    "text3": "¡Gracias por tu visita!",
    "repoLink": "https://github.com/escuderoemanuel/next-intl-app"
  },
  "ContactPage": {
    "title": "Mis datos",
    "description": "¿Quieres contactarme?",
    "linkedIn": "https://www.linkedin.com/in/emanuelescudero",
    "gitHub": "https://github.com/escuderoemanuel",
    "website": "https://emanuelescudero.ar"
  }
}